Revit 2027 API
RouteAnalysisSettings.IgnoreImports Property
 If true, import instances are ignored by route calculation. For imports to be ignored, also EnableIgnoredCategoryIds must be set to true.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IgnoreImports { get; set; }
Public Property IgnoreImports As Boolean
	Get
	Set
public:
property bool IgnoreImports {
	bool get ();
	void set (bool value);
}
member IgnoreImports : bool with get, set
Property Value
Boolean
See Also
Reference
RouteAnalysisSettings Class
Autodesk.Revit.DB.Analysis Namespace